[
    {
        "id": 1,
        "name": "Banding Together",
        "subTitle": "E-Communication and Collaboration Web App",
        "description": "Banding Together is a user-friendly web application that combines essential features required by the target users (freelancers, students, remote workers, and companies), including chat, meet, project planning features, performance tracking tools, and more. Additionally, the system incorporates a Recommendation system to assist freelancers in finding suitable project-based opportunities and help job owners find suitable employees.",
        "demo":"https://drive.google.com/uc?id=1shebb16I6g27druutkGtjkKgzBcWjfyU",
        "myPart": "This is my graduation project, I contributed in <b>UI/UX design, Graphic Design, frontend development</b>, and played a role in <b>implementing the recommendation system</b>.",
        "technologies":"For the UI Design part we used <b>Figma</b>. <br /><br />For the Web application development we used <b>MERN stack</b> with <b>websockets</b> for the real-time communication and <b>cloudinary</b> as a cloud.  <br /><br />We used <b>Chakra UI</b> as CSS framework.",
        "img": "/bt.png",
        "logo": "/btLogo.svg",
        "link": "",
        "website":true,
        "github":""
    },
    {
        "id": 2,
        "name": "Bianca",
        "subTitle": "Real-Time Whitboard",
        "description": "Bianca is a website that allows users to collaboratively draw and share ideas in real time or work individually:<ul><li><strong>User Authentication:</strong> Easily sign up or log in to get started.</li><li><strong>Whiteboard Creation:</strong> Create new digital canvases for your ideas.</li><li><strong>Save and Manage:</strong> Keep track of your previous whiteboards and manage them effortlessly.</li><li><strong>Privacy Controls:</strong> Adjust permissions to decide whether your whiteboard is public or private.</li><li><strong>Real-time Interaction:</strong> Collaborate in real time with others on the same whiteboard.</li><li><strong>Drawing Tools:</strong> Express yourself with intuitive pencil, brush, and shape tools.</li><li><strong>Navigation:</strong> Effortlessly move between your ideas with undo/redo options.</li><li><strong>Clear and Download:</strong> Clear the canvas or download your creations for future reference.</li><li><strong>Responsive Design:</strong> Enjoy a seamless experience on both desktop and mobile devices.</li></ul>",   
        "demo":"https://drive.google.com/uc?id=12gg2tnLDUjgmP9dnSvpYejSgzcs-HslL",
        "myPart": "As the sole developer, I successfully completed the job search website using React JS front-end library. With my expertise in frontend engineering, I developed the website, ensuring its functionality and user experience met the project goals.",
        "technologies":"For the UI Design part I used <b>Figma</b>. <br /><br />For the Web application development I used <b>React JS</b> with <b>Firebase</b> for the Authentication and Real-Time collaboration.",
        "img": "/whiteboard.png",
        "logo": "/logoShape.svg",
        "link": "https://whiteboard-pearl-seven.vercel.app/",
        "website":true,
        "github":""
    },
    {
        "id": 4,
        "name": "Hangman Game",
        "subTitle": "A simple game using Typescript",
        "description": "The Hangman Game is a web-based word-guessing game designed for entertainment. It offers users the opportunity to play in both Arabic and English languages and provides options for dark and light modes to suit different preferences. The game is not limited to a single category but offers four different topics, including general words, movies, food, and countries. Players can enjoy a fun and challenging experience while playing and expanding their word knowledge. <br /><br /> <strong>Features:</strong> <br /><ul><li><strong>Multilingual Support:</strong>  The game is available in both Arabic and English, allowing players to choose their preferred language for an immersive experience.</li><br /><li><strong>Dark and Light Modes:</strong> Users can switch between dark and light themes to enhance gameplay comfort.</li><br /><li><strong>Multiple Categories:</strong> General, Food, Movies, and Countries.</li><br /><li><strong>Randomized Words:</strong> The game offers a wide variety of words within each category to keep the gameplay fresh and challenging.</li><br /><li><strong>Responsive Design:</strong> Enjoy a seamless experience on both desktop and mobile devices.</li></ul>",        
        "demo":"https://drive.google.com/uc?id=1pA1qg5q1tpW3wlroCqC5nxc3Ixl-lbHX",
        "myPart": "As the sole developer, I successfully completed the job search website using React JS front-end library and Typescript. With my expertise in frontend engineering, I developed the website, ensuring its functionality and user experience met the project goals.",
        "technologies":"<b>React JS and Typescript</b> for the Web application development. <br /><br />I used <b>Vite</b> as a fast development build tool.",
        "img": "/mockuperHangman.png",
        "logo":"/hangman.png",
        "link": "https://hangman-game-nourhan-ashraf.vercel.app/",
        "website":true,
        "github":"https://github.com/nourhan-ashraf/Hangman-Game"
    },
    {
        "id": 3,
        "name": "Job search",
        "subTitle": "A job search using an API",
        "description": "The aim of this project was to develop a job search website using a React frontend library integrated with an API. The website offers multiple functionalities to improve the user experience. Users can search for jobs based on keywords or job titles. The job listings provide important details such as company name, location, tags, and posting time. When a user selects a job, they can access comprehensive job descriptions and instructions on how to apply.I improved the user interface in the most recent update to resemble the Wuzzuf interface. Users now have the choice to either create an account or log in, enabling them to customize their profiles by adding personal information. Additionally, they have the ability to save job listings for future reference.",        
        "demo":"https://drive.google.com/uc?id=1SA0SLEkiRPpeG59lcLAmh51YT5nrQrgF",
        "myPart": "As the sole developer, I successfully completed the job search website using React JS front-end library. With my expertise in frontend engineering, I developed the website, ensuring its functionality and user experience met the project goals.",
        "technologies":"<b>React JS</b> for the Web application development. <br /><br />I used <b>Bootstrap</b> and <b>Chakra UI</b> as CSS frameworks. <br /> <br /> For authentication, <b>Firebase</b> is utilized, serving as a serverless database and storage solution.",
        "img": "/wuzzuf.png",
        "logo":"",
        "link": "https://github-job-search.vercel.app/",
        "website":true,
        "github":"https://github.com/nourhan-ashraf/Github-Job-Search"
    },
   
    {
        "id": 5,
        "name": "Portfolio",
        "subTitle": "My personal portfolio",
        "description": "My website portfolio is a showcase of my work, designed and developed by me using ReactJS. It reflects my skills and expertise in front-end development, highlighting various projects I have worked on. Through this portfolio, I aim to demonstrate my proficiency in creating visually appealing and interactive web applications using modern web technologies.",
        "demo":"",
        "myPart": "",
        "technologies":"For the UI Design part I used <b>Figma</b>.<br /><br />For the Web application development I used <b>React JS</b>.",
        "img": "/mockuper.png",
        "logo":"",
        "link": "https://portfolio-mu-eosin-12.vercel.app/",
        "website":true,
        "github":"https://github.com/nourhan-ashraf/Portfolio"
    }
]